10/data/attachments/e7c848dea9f29911.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_36349043-2038-4cee-871b-acfc033fc699</nif:username>
            <nif:friendToBeAdded>Christopher_ago_Friend_24444_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>